; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p11---int100n150-m25---int100c200---s165---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 - fuellevel
)

(:init
(sum level0 level10 level10)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level10 level11)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level10 level12)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level10 level13)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level10 level14)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level5 level10 level15)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level6 level10 level16)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level7 level10 level17)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level8 level10 level18)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level9 level10 level19)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level10 level10 level20)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level11 level10 level21)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level12 level10 level22)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level13 level10 level23)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level14 level10 level24)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level15 level10 level25)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level16 level10 level26)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level17 level10 level27)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level18 level10 level28)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level19 level10 level29)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level20 level10 level30)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level21 level10 level31)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level22 level10 level32)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level23 level10 level33)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level24 level10 level34)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level25 level10 level35)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level26 level10 level36)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level27 level10 level37)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level28 level10 level38)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level29 level10 level39)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level30 level10 level40)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level31 level10 level41)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level32 level10 level42)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level33 level10 level43)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level34 level10 level44)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level35 level10 level45)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level36 level10 level46)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level37 level10 level47)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level38 level10 level48)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level39 level10 level49)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level40 level10 level50)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level41 level10 level51)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level42 level10 level52)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level43 level10 level53)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level44 level10 level54)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level45 level10 level55)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level46 level10 level56)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level47 level10 level57)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level10 level58)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level10 level59)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level50 level10 level60)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level51 level10 level61)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level52 level10 level62)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level53 level10 level63)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level54 level10 level64)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level55 level10 level65)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level56 level10 level66)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level57 level10 level67)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level58 level10 level68)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level59 level10 level69)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level60 level10 level70)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level61 level10 level71)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level62 level10 level72)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level63 level10 level73)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level64 level10 level74)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level65 level10 level75)
(sum level65 level20 level85)
(sum level65 level22 level87)
(sum level66 level10 level76)
(sum level66 level20 level86)
(sum level66 level22 level88)
(sum level67 level10 level77)
(sum level67 level20 level87)
(sum level67 level22 level89)
(sum level68 level10 level78)
(sum level68 level20 level88)
(sum level68 level22 level90)
(sum level69 level10 level79)
(sum level69 level20 level89)
(sum level69 level22 level91)
(sum level70 level10 level80)
(sum level70 level20 level90)
(sum level70 level22 level92)
(sum level71 level10 level81)
(sum level71 level20 level91)
(sum level71 level22 level93)
(sum level72 level10 level82)
(sum level72 level20 level92)
(sum level72 level22 level94)
(sum level73 level10 level83)
(sum level73 level20 level93)
(sum level73 level22 level95)
(sum level74 level10 level84)
(sum level74 level20 level94)
(sum level74 level22 level96)
(sum level75 level10 level85)
(sum level75 level20 level95)
(sum level75 level22 level97)
(sum level76 level10 level86)
(sum level76 level20 level96)
(sum level76 level22 level98)
(sum level77 level10 level87)
(sum level77 level20 level97)
(sum level77 level22 level99)
(sum level78 level10 level88)
(sum level78 level20 level98)
(sum level78 level22 level100)
(sum level79 level10 level89)
(sum level79 level20 level99)
(sum level79 level22 level101)
(sum level80 level10 level90)
(sum level80 level20 level100)
(sum level80 level22 level102)
(sum level81 level10 level91)
(sum level81 level20 level101)
(sum level81 level22 level103)
(sum level82 level10 level92)
(sum level82 level20 level102)
(sum level82 level22 level104)
(sum level83 level10 level93)
(sum level83 level20 level103)
(sum level83 level22 level105)
(sum level84 level10 level94)
(sum level84 level20 level104)
(sum level84 level22 level106)
(sum level85 level10 level95)
(sum level85 level20 level105)
(sum level85 level22 level107)
(sum level86 level10 level96)
(sum level86 level20 level106)
(sum level86 level22 level108)
(sum level87 level10 level97)
(sum level87 level20 level107)
(sum level87 level22 level109)
(sum level88 level10 level98)
(sum level88 level20 level108)
(sum level88 level22 level110)
(sum level89 level10 level99)
(sum level89 level20 level109)
(sum level89 level22 level111)
(sum level90 level10 level100)
(sum level90 level20 level110)
(sum level90 level22 level112)
(sum level91 level10 level101)
(sum level91 level20 level111)
(sum level91 level22 level113)
(sum level92 level10 level102)
(sum level92 level20 level112)
(sum level92 level22 level114)
(sum level93 level10 level103)
(sum level93 level20 level113)
(sum level93 level22 level115)
(sum level94 level10 level104)
(sum level94 level20 level114)
(sum level94 level22 level116)
(sum level95 level10 level105)
(sum level95 level20 level115)
(sum level95 level22 level117)
(sum level96 level10 level106)
(sum level96 level20 level116)
(sum level96 level22 level118)
(sum level97 level10 level107)
(sum level97 level20 level117)
(sum level97 level22 level119)
(sum level98 level10 level108)
(sum level98 level20 level118)
(sum level98 level22 level120)
(sum level99 level10 level109)
(sum level99 level20 level119)
(sum level100 level10 level110)
(sum level100 level20 level120)
(sum level101 level10 level111)
(sum level102 level10 level112)
(sum level103 level10 level113)
(sum level104 level10 level114)
(sum level105 level10 level115)
(sum level106 level10 level116)
(sum level107 level10 level117)
(sum level108 level10 level118)
(sum level109 level10 level119)
(sum level110 level10 level120)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l1)
(fuelcost level20 l2 l1)

(at t0 l1)
(fuel t0 level120)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l0)
(at p8 l0)
(at p9 l1)
(at p10 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l2)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l1)
(at p7 l1)
(at p8 l2)
(at p9 l2)
(at p10 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 11
2. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 11
3. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 11
4. (drive t0 l1 l2 level100 level20 level120)
   deleted: (at t0 l1) (fuel t0 level120)
   added: (at t0 l2) (fuel t0 level100)
   goals met: 0 of 11
5. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 11
6. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 11
7. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 2 of 11
8. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 11
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 11
10. (drive t0 l2 l0 level90 level10 level100)
   deleted: (at t0 l2) (fuel t0 level100)
   added: (at t0 l0) (fuel t0 level90)
   goals met: 2 of 11
11. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 11
12. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 4 of 11
13. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 4 of 11
14. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 4 of 11
15. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 4 of 11
16. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 4 of 11
17. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 4 of 11
18. (drive t0 l0 l1 level68 level22 level90)
   deleted: (at t0 l0) (fuel t0 level90)
   added: (at t0 l1) (fuel t0 level68)
   goals met: 4 of 11
19. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 11
20. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 6 of 11
21. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 7 of 11
22. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 8 of 11
23. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 9 of 11
24. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 10 of 11
25. (drive t0 l1 l2 level48 level20 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l2) (fuel t0 level48)
   goals met: 10 of 11
26. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 11 of 11
